{
  "architectures": ["LlamaForCausalLM"],
  "model_type": "llama",
  "hidden_size": 1024,
  "intermediate_size": 2816,
  "num_hidden_layers": 24,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "vocab_size": 128256,
  "max_position_embeddings": 2048,
  "rms_norm_eps": 1e-5,
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "hidden_act": "silu",
  "initializer_range": 0.02,
  "use_cache": false,
  "torch_dtype": "bfloat16"
}
